[
  {
    "id": "spooky-runner",
    "category": "academic",
    "title": "Spooky Runner",
    "duration": "Sep 2025 - Present",
    "image": "assets/images/SR/SR_TitleScreen.png",
    "description": "Served as the Backend Programmer on an 11-member team leading server-side development for a live-service game.",
    "technologies": ["C#", "Unity", "Node.js", "MySQL"],
    "features": [
      "Implemented score calculation logic in Unity using C#, processing player actions and game events in real-time",
      "Established a stable 24/7 live service environment by migrating the full-stack backend architecture from local servers to Oracle Cloud",
      "Engineered a real-time leaderboard system using Node.js and MySQL with optimized SQL queries",
      "Accelerated the development cycle by creating a CSV-based parsing tool for designers to balance gameplay values",
      "Built a web-based admin dashboard for monitoring player activity and managing records"
    ],
    "challenges": "Migrating from local servers to Oracle Cloud to ensure 24/7 availability and handling concurrent player requests efficiently.",
    "results": "Successfully established a stable live service environment and optimized development workflow with custom tools.",
    "links": {
      "github": "https://github.com/MinerSheep/TheRespawnBureau",
      "demo": ""
    }
  },
  {
    "id": "children-sleeping",
    "category": "academic",
    "title": "The Children Are Sleeping",
    "duration": "Sep 2024 - May 2025",
    "image": "assets/images/TCAS/TCAS_TitleScreen.png",
    "gallery": [ 
      "assets/images/TCAS/TCAS_TitleScreen.png",
      "assets/images/TCAS/TCAS_Ingame1.png",
      "assets/images/TCAS/TCAS_Ingame2.png"
    ],
    "description": "Led VFX creation and rendering optimization as the team's Graphics Programmer on a 13-member team.",
    "technologies": ["Blueprint", "Unreal Engine", "Niagara", "Optimization"],
    "features": [
      "Engineered a dynamic post-processing system to visually represent player sanity with vignette and grayscale effects",
      "Authored key gameplay VFX in Niagara based on artist’s concept art, including item glows and monster threat auras",
      "Profiled the rendering pipeline with Unreal Insights to identify and resolve performance bottlenecks",
      "Implemented strategic lighting optimizations, such as using static shadows in Lumen, to boost framerates by over 30 FPS",
      "Developed the technical art pipeline with parameter-driven materials and VFX documentation"
    ],
    "challenges": "Balancing high-quality visual effects with performance requirements in Unreal Engine 5.",
    "results": "Boosted framerates by over 30 FPS through lighting optimizations and established an efficient technical art pipeline.",
    "links": {
      "github": "",
      "demo": "https://youtu.be/sFZGCw8Hm4k"
    }
  },
  {
    "id": "kingdom-boardgames",
    "category": "academic",
    "title": "Kingdom of Boardgames",
    "duration": "Feb 2024 - Jul 2024",
    "image": "assets/images/KOB/KOB_TitleScreen.png",
    "gallery": [ 
      "assets/images/KOB/KOB_TitleScreen.png",
      "assets/images/KOB/KOB_Ingame1.png",
      "assets/images/KOB/KOB_Ingame2.png",
      "assets/images/KOB/KOB_Ingame3.png"
    ],
    "description": "Implemented a custom shader component and authored shaders in the custom 2D game engine as a Tool Developer.",
    "technologies": ["C++", "OpenGL", "GLSL", "Game Engine"],
    "features": [
      "Architected a centralized shader manager using a custom GLShaderArray to load and apply all shaders instantly",
      "Authored four GLSL shaders that add dynamic fog, rain, lightning, and flowing waters, boosting overall visual immersion",
      "Enabled shader animations by developing a custom stopwatch component to pass the engine’s delta time to fragment shaders",
      "Provided an accessible shader pipeline that allowed team members to apply visual effects using a simple Enum for shader type"
    ],
    "challenges": "Integrating a flexible shader system into a custom 2D game engine for non-technical team members.",
    "results": "Successfully implemented dynamic environmental effects and created an accessible tool for artists/designers.",
    "links": {
      "github": "",
      "demo": "https://youtu.be/B1GKArn6drM"
    }
  },
  {
    "id": "if-i-were-king",
    "category": "academic",
    "title": "If I Were the King",
    "duration": "Jan 2024",
    "image": "assets/images/IIWK/IIWK_TitleScreen.png",
    "gallery": [ 
      "assets/images/IIWK/IIWK_TitleScreen.png",
      "assets/images/IIWK/IIWK_Ingame1.png",
      "assets/images/IIWK/IIWK_Ingame2.png"
    ],
    "description": "Implemented UI from scratch in 'If I Were the King', serving as the dedicated UI/UX programmer on a 6-member team.",
    "technologies": ["Unity", "C#", "UI/UX", "DOTween"],
    "features": [
      "Wrote C# scripts and used UGUI to implement a tutorial sequence, settings panels, and HUDs with dynamic resource gauges",
      "Utilized DOTween library and Unity’s Timeline to make procedural UI animations and narrative cutscenes with visual effects",
      "Earned a formal certification for successfully completing the program and delivering the final team project over a 3-week sprint",
      "itch.io Password: kangmakes"
    ],
    "challenges": "Delivering a polished UI/UX experience within a short 3-week sprint.",
    "results": "Completed the project successfully with dynamic UI animations and earned formal certification.",
    "links": {
      "github": "https://github.com/donghyunkang-digipen/EPITECH",
      "demo": ""
    }
  },
  {
    "id": "palagang",
    "category": "academic",
    "title": "Palagang",
    "duration": "Aug 2023 - Dec 2023",
    "image": "assets/images/PK/PK_TitleScreen.png",
    "gallery": [ 
      "assets/images/PK/PK_TitleScreen.png",
      "assets/images/PK/PK_Ingame1.png",
      "assets/images/PK/PK_Ingame2.png",
      "assets/images/PK/PK_Ingame3.png"
    ],
    "description": "Architected a 2D game engine from scratch, as the team’s Engine Programmer and Producer.",
    "technologies": ["C++", "OpenGL", "SDL2", "SFML"],
    "features": [
      "Integrated foundational libraries for core game engine functions: SDL2 (Window), OpenGL (Graphics), SFML (Audio)",
      "Diagnosed and resolved critical engine-level bugs, caused by dangling pointers and an input processing error",
      "Engineered a font rendering system that parsed and drew characters from a single sprite sheet",
      "Developed a trigger system for complex AI state changes and a Verlet-based physics engine with AABB collision detection"
    ],
    "challenges": "Building a game engine from scratch and resolving low-level memory and input issues.",
    "results": "Built a functional 2D engine with physics, audio, and font rendering systems.",
    "links": {
      "github": "",
      "demo": "",
      "guide": "assets/images/PK/PK_Technical_Guide.pdf"
    }
  }
]